xzcvczx/mla-legacy/Graphics MultiApp Demo/Alternative Configurations/HardwareProfile_PIC24FJ256DA210_DEV_BOARD_16PMP_MCHP_DA210_USBMSD_HID_TFT_G240320LTSW_118W_E.h
		// macros to define the access timing of the parallel device in EPMP CS2
		#define EPMPCS2_DWAITB		0		// chip select 2 data set up before read/write strobe
		#define EPMPCS2_DWAITM		4		// chip select 2 read/write strobe wait states
		#define EPMPCS2_DWAITE		0		// chip select 2 data hold after read/write strobe
		#define EPMPCS2_AMWAIT		3		// chip select 6 Alternate Master wait state 

	#endif
#endif

/*********************************************************************
* IOS FOR THE UART
*********************************************************************/
#if defined(__dsPIC33FJ128GP804__) || defined(__PIC24HJ128GP504__)
    #define TX_TRIS TRISCbits.TRISC1
    #define RX_TRIS TRISCbits.TRISC0
#elif defined(__PIC24FJ256DA210__)    
    #define TX_TRIS TRISFbits.TRISF3
    #define RX_TRIS TRISDbits.TRISD0
#else
    #define TX_TRIS TRISFbits.TRISF5
    #define RX_TRIS TRISFbits.TRISF4
#endif

/*********************************************************************
* RTCC DEFAULT INITIALIZATION (these are values to initialize the RTCC
*********************************************************************/
#define RTCC_DEFAULT_DAY        15      // 15th
#define RTCC_DEFAULT_MONTH      10      // October
#define RTCC_DEFAULT_YEAR       10      // 2010
#define RTCC_DEFAULT_WEEKDAY    05      // Friday
#define RTCC_DEFAULT_HOUR       10      // 10:10:01
#define RTCC_DEFAULT_MINUTE     10
#define RTCC_DEFAULT_SECOND     01

#if defined (MULTI_MEDIA_BOARD_DM00123)

#include <plib.h>

/*********************************************************************
* Configuration for the CPLD
*********************************************************************/
#ifdef USE_16BIT_PMP
#define GRAPHICS_HW_CONFIG     CPLD_GFX_CONFIG_16BIT
#else
#define GRAPHICS_HW_CONFIG     CPLD_GFX_CONFIG_8BIT
#endif

/*********************************************************************
* MMB LEDs
*********************************************************************/
typedef enum
{
    LED_2,
    LED_3,
    LED_4,
    LED_5,
    LED_10
}MMB_LED;

extern inline void __attribute__((always_inline)) SetLEDDirection(void)
{
   PORTSetPinsDigitalOut(IOPORT_D, (BIT_1 | BIT_2 | BIT_3));
    PORTSetPinsDigitalOut(IOPORT_C, (BIT_1 | BIT_2));
}

extern inline void __attribute__((always_inline)) TurnLEDOn(MMB_LED led)
{
    if(led == LED_2)
      PORTSetBits(IOPORT_D, BIT_1);

    if(led == LED_3)
      PORTSetBits(IOPORT_D, BIT_2);

    if(led == LED_4)
      PORTSetBits(IOPORT_D, BIT_3);

    if(led == LED_5)
      PORTSetBits(IOPORT_C, BIT_1);

    if(led == LED_10)
      PORTSetBits(IOPORT_C, BIT_2);

}

extern inline void __attribute__((always_inline)) TurnLEDOff(MMB_LED led)
{
    if(led == LED_2)
      PORTClearBits(IOPORT_D, BIT_1);

    if(led == LED_3)
      PORTClearBits(IOPORT_D, BIT_2);

    if(led == LED_4)
      PORTClearBits(IOPORT_D, BIT_3);

    if(led == LED_5)
      PORTClearBits(IOPORT_C, BIT_1);

    if(led == LED_10)
      PORTClearBits(IOPORT_C, BIT_2);

}

extern inline void __attribute__((always_inline)) ToggleLED(MMB_LED led)
{
    if(led == LED_2)
      PORTToggleBits(IOPORT_D, BIT_1);

    if(led == LED_3)
      PORTToggleBits(IOPORT_D, BIT_2);

    if(led == LED_4)
      PORTToggleBits(IOPORT_D, BIT_3);

    if(led == LED_5)
      PORTToggleBits(IOPORT_C, BIT_1);

    if(led == LED_10)
      PORTToggleBits(IOPORT_C, BIT_2);

}

extern inline void __attribute__((always_inline)) TurnLEDAllOn(void)
{
      PORTSetBits(IOPORT_D, BIT_1);
      PORTSetBits(IOPORT_D, BIT_2);
      PORTSetBits(IOPORT_D, BIT_3);
      PORTSetBits(IOPORT_C, BIT_1);
      PORTSetBits(IOPORT_C, BIT_2);

}

extern inline void __attribute__((always_inline)) TurnLEDAllOff(void)
{
      PORTClearBits(IOPORT_D, BIT_1);
      PORTClearBits(IOPORT_D, BIT_2);
      PORTClearBits(IOPORT_D, BIT_3);
      PORTClearBits(IOPORT_C, BIT_1);
      PORTClearBits(IOPORT_C, BIT_2);

}
#endif // #ifdef (MULTI_MEDIA_BOARD_DM00123)

/*********************************************************************
 *********************************************************************
 * IOS FOR THE SD Card INTERFACE
 * Used only when Demos using SD Card is enabled
 * For PIC24FJ256GB110 Use SPI1 only. SPI2 pins in PICtail Plus is
 * used by USB.
 * For PIC24FJ256GA110 Use SPI2 only. SPI2 pins in PICtail Plus is
 * used by USB.
 * For PIC32MX360F512L Use SPI1 only. 
 ********************************************************************* 
*********************************************************************/
/* SD Card definitions: Change these to fit your application when using
   an SD-card-based physical layer                                   */
	#if defined (__32MX460F512L__)

		//SPI Configuration
		#define SPI_START_CFG_1 (PRI_PRESCAL_64_1 | SEC_PRESCAL_8_1 | MASTER_ENABLE_ON | SPI_CKE_ON | SPI_SMP_ON)
		#define SPI_START_CFG_2 (SPI_ENABLE)
		// Define the SPI frequency
		#define SPI_FREQUENCY   (20000000)

		// Description: SD-SPI Chip Select Output bit
		#define SD_CS   PORTBbits.RB1
		// Description: SD-SPI Chip Select TRIS bit
		#define SD_CS_TRIS  TRISBbits.TRISB1
		// Description: SD-SPI Card Detect Input bit
		#define SD_CD   PORTFbits.RF0
		// Description: SD-SPI Card Detect TRIS bit
		#define SD_CD_TRIS  TRISFbits.TRISF0
		// Description: SD-SPI Write Protect Check Input bit
		#define SD_WE   PORTFbits.RF1
		// Description: SD-SPI Write Protect Check TRIS bit
		#define SD_WE_TRIS  TRISFbits.TRISF1

		// Description: The main SPI control register
		#define SPICON1 SPI1CON
		// Description: The SPI status register
		#define SPISTAT SPI1STAT
		// Description: The SPI Buffer
		#define SPIBUF  SPI1BUF
		// Description: The receive buffer full bit in the SPI status register
		#define SPISTAT_RBF SPI1STATbits.SPIRBF
		// Description: The bitwise define for the SPI control register (i.e. _____bits)
		#define SPICON1bits SPI1CONbits
		// Description: The bitwise define for the SPI status register (i.e. _____bits)
		#define SPISTATbits SPI1STATbits
		// Description: The enable bit for the SPI module
		#define SPIENABLE   SPICON1bits.ON
		// Description: The definition for the SPI baud rate generator register (PIC32)
		#define SPIBRG  SPI1BRG

		// Tris pins for SCK/SDI/SDO lines
		// Description: The TRIS bit for the SCK pin
		#define SPICLOCK    TRISFbits.TRISF6
		// Description: The TRIS bit for the SDI pin
		#define SPIIN   TRISFbits.TRISF7
		// Description: The TRIS bit for the SDO pin
		#define SPIOUT  TRISFbits.TRISF8
		
		//SPI library functions
		#define putcSPI                     putcSPI1
		#define getcSPI                     getcSPI1
		#define OpenSPI(config1, config2)   OpenSPI1(config1, config2)

	#elif defined (__32MX360F512L__)
		//SPI Configuration
		#define SPI_START_CFG_1     (PRI_PRESCAL_64_1 | SEC_PRESCAL_8_1 | MASTER_ENABLE_ON | SPI_CKE_ON | SPI_SMP_ON)
		#define SPI_START_CFG_2     (SPI_ENABLE)

		// Define the SPI frequency
		#define SPI_FREQUENCY		(20000000)

		// Description: SD-SPI Chip Select Output bit
		#define SD_CS               PORTBbits.RB1
		// Description: SD-SPI Chip Select TRIS bit
		#define SD_CS_TRIS          TRISBbits.TRISB1
	            
