xzcvczx/mla-legacy/Graphics MultiApp Demo/Alternative Configurations/HardwareProfile_PIC24FJ256DA210_DEV_BOARD_16PMP_MCHP_DA210_USBMSD_HID_TFT_G240320LTSW_118W_E.h
		// Description: SD-SPI Card Detect Input bit
		#define SD_CD               PORTFbits.RF0
		// Description: SD-SPI Card Detect TRIS bit
		#define SD_CD_TRIS          TRISFbits.TRISF0

		// Description: SD-SPI Write Protect Check Input bit
		#define SD_WE               PORTFbits.RF1
		// Description: SD-SPI Write Protect Check TRIS bit
		#define SD_WE_TRIS          TRISFbits.TRISF1
	                   
		// Description: The main SPI control register
		#define SPICON1             SPI1CON
		// Description: The SPI status register
		#define SPISTAT             SPI1STAT
		// Description: The SPI Buffer
		#define SPIBUF              SPI1BUF
		// Description: The receive buffer full bit in the SPI status register
		#define SPISTAT_RBF         SPI1STATbits.SPIRBF
		// Description: The bitwise define for the SPI control register (i.e. _____bits)
		#define SPICON1bits         SPI1CONbits
		// Description: The bitwise define for the SPI status register (i.e. _____bits)
		#define SPISTATbits         SPI1STATbits
		// Description: The enable bit for the SPI module
		#define SPIENABLE           SPICON1bits.ON
		// Description: The definition for the SPI baud rate generator register (PIC32)
		#define SPIBRG			    SPI1BRG

		// Tris pins for SCK/SDI/SDO lines
		// Description: The TRIS bit for the SCK pin
		
		#define SPICLOCK            TRISFbits.TRISF6
		// Description: The TRIS bit for the SDI pin
		#define SPIIN               TRISFbits.TRISF7
		// Description: The TRIS bit for the SDO pin
		#define SPIOUT              TRISFbits.TRISF8
		//SPI library functions
		#define putcSPI             putcSPI1
		#define getcSPI             getcSPI1
		#define OpenSPI(config1, config2)   OpenSPI1(config1, config2)

		// If SPI2 on PICTail Plus Port is used use this:
		/*
		// Description: SD-SPI Chip Select Output bit
		#define SD_CS               PORTBbits.RB9
		// Description: SD-SPI Chip Select TRIS bit
		#define SD_CS_TRIS          TRISBbits.TRISB9
	    
		// Description: SD-SPI Card Detect Input bit
		#define SD_CD               PORTGbits.RG0
		// Description: SD-SPI Card Detect TRIS bit
		#define SD_CD_TRIS          TRISGbits.TRISG0

		// Description: SD-SPI Write Protect Check Input bit
		#define SD_WE               PORTGbits.RG1
		// Description: SD-SPI Write Protect Check TRIS bit
		#define SD_WE_TRIS          TRISGbits.TRISG1
	    
		// Description: The main SPI control register
		#define SPICON1             SPI2CON
		// Description: The SPI status register
		#define SPISTAT             SPI2STAT
		// Description: The SPI Buffer
		#define SPIBUF              SPI2BUF
		// Description: The receive buffer full bit in the SPI status register
		#define SPISTAT_RBF         SPI2STATbits.SPIRBF
		// Description: The bitwise define for the SPI control register (i.e. _____bits)
		#define SPICON1bits         SPI2CONbits
		// Description: The bitwise define for the SPI status register (i.e. _____bits)
		#define SPISTATbits         SPI2STATbits
		// Description: The enable bit for the SPI module
		#define SPIENABLE           SPI2CONbits.ON
		// Description: The definition for the SPI baud rate generator register (PIC32)
		#define SPIBRG			    SPI2BRG

		// Tris pins for SCK/SDI/SDO lines

		// Description: The TRIS bit for the SCK pin
		#define SPICLOCK            TRISGbits.TRISG6
		// Description: The TRIS bit for the SDI pin
		#define SPIIN               TRISGbits.TRISG7
		// Description: The TRIS bit for the SDO pin
		#define SPIOUT              TRISGbits.TRISG8
		//SPI library functions
		#define putcSPI             putcSPI2
		#define getcSPI             getcSPI2
		#define OpenSPI(config1, config2)   OpenSPI2(config1, config2)

		*/

	#elif defined (__PIC24FJ256DA210__)

		// Description: SD-SPI Chip Select Output bit
		#define SD_CS   PORTGbits.RG6
		// Description: SD-SPI Chip Select TRIS bit
		#define SD_CS_TRIS  TRISGbits.TRISG6
		// Description: SD-SPI Card Detect Input bit
		#define SD_CD   PORTAbits.RA15
		// Description: SD-SPI Card Detect TRIS bit
		#define SD_CD_TRIS  TRISAbits.TRISA15
		// Description: SD-SPI Write Protect Check Input bit
		#define SD_WE   PORTAbits.RA7
		// Description: SD-SPI Write Protect Check TRIS bit
		#define SD_WE_TRIS  TRISAbits.TRISA7

		// Registers for the SPI module you want to use
		// Description: The main SPI control register
		#define SPICON1 SPI1CON1
		// Description: The SPI status register
		#define SPISTAT SPI1STAT
		// Description: The SPI Buffer
		#define SPIBUF  SPI1BUF
		// Description: The receive buffer full bit in the SPI status register
		#define SPISTAT_RBF SPI1STATbits.SPIRBF
		// Description: The bitwise define for the SPI control register (i.e. _____bits)
		#define SPICON1bits SPI1CON1bits
		// Description: The bitwise define for the SPI status register (i.e. _____bits)
		#define SPISTATbits SPI1STATbits
		// Description: The enable bit for the SPI module
		#define SPIENABLE   SPISTATbits.SPIEN

		// Tris pins for SCK/SDI/SDO lines
		// for (PIC24FJ256GB110 SPI 1)
		// Description: The TRIS bit for the SCK pin
		#define SPICLOCK    TRISDbits.TRISD8

		// Description: The TRIS bit for the SDI pin
		#define SPIIN   TRISBbits.TRISB1

		// Description: The TRIS bit for the SDO pin
		#define SPIOUT  TRISBbits.TRISB0

	#elif defined (__PIC24FJ256GB110__) || defined (__PIC24FJ256GB210__)
		
		// Description: SD-SPI Chip Select Output bit
		#define SD_CS   PORTBbits.RB1
		// Description: SD-SPI Chip Select TRIS bit
		#define SD_CS_TRIS  TRISBbits.TRISB1
		// Description: SD-SPI Card Detect Input bit
		#define SD_CD   PORTFbits.RF0
		// Description: SD-SPI Card Detect TRIS bit
		#define SD_CD_TRIS  TRISFbits.TRISF0
		// Description: SD-SPI Write Protect Check Input bit
		#define SD_WE   PORTFbits.RF1
		// Description: SD-SPI Write Protect Check TRIS bit
		#define SD_WE_TRIS  TRISFbits.TRISF1
		
		// Registers for the SPI module you want to use
		// Description: The main SPI control register
		#define SPICON1 SPI1CON1
		// Description: The SPI status register
		#define SPISTAT SPI1STAT
		// Description: The SPI Buffer
		#define SPIBUF  SPI1BUF
		// Description: The receive buffer full bit in the SPI status register
		#define SPISTAT_RBF SPI1STATbits.SPIRBF
		// Description: The bitwise define for the SPI control register (i.e. _____bits)
		#define SPICON1bits SPI1CON1bits
		// Description: The bitwise define for the SPI status register (i.e. _____bits)
		#define SPISTATbits SPI1STATbits
		// Description: The enable bit for the SPI module
		#define SPIENABLE   SPISTATbits.SPIEN

		// Tris pins for SCK/SDI/SDO lines
		// for (PIC24FJ256GB110 SPI 1)
		// Description: The TRIS bit for the SCK pin
		#define SPICLOCK    TRISBbits.TRISB0

		// Description: The TRIS bit for the SDI pin
		#define SPIIN   TRISDbits.TRISD2

		// Description: The TRIS bit for the SDO pin
		#define SPIOUT  TRISFbits.TRISF8

	#elif defined (__PIC24FJ256GA110__)
		// Description: SD-SPI Chip Select Output bit
		#define SD_CS               PORTBbits.RB9
		// Description: SD-SPI Chip Select TRIS bit
		#define SD_CS_TRIS          TRISBbits.TRISB9
		        
